# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq' # Used for spatie/visit
brew 'pkg-config'
brew 'svn' # Needed to install fonts
brew 'stow'
brew 'eza'
brew 'fd'
brew 'fnm'
brew 'fontconfig'
brew 'fzf'
brew 'htop'
brew 'lazygit'
brew 'ripgrep'
brew 'tree'
brew 'neovim'
brew 'neofetch'
brew 'yarn'
brew 'node'

# Development
# Add your development packages here

# Apps
cask 'discord'
cask 'spotify'
cask 'bitwarden'
cask 'docker'
cask 'brave-browser'
cask 'insomnia'
cask 'pastebot'
cask 'readdle-spark'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'tuple'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-mono-nerd-font'
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-noto-nerd-font'

# Casks
cask 'alacritty'
cask 'arc-gtk-theme'
cask 'blueman'
cask 'brave-browser'
cask 'cmatrix'
cask 'discord'
cask 'docker'
cask 'dunst'
cask 'element-nightly'
cask 'exa'
cask 'fastfetch'
cask 'feh'
cask 'flameshot'
cask 'fnm'
cask 'gammastep'
cask 'gimp'
cask 'git'
cask 'github'
cask 'gitui'
cask 'glances'
cask 'gotop'
cask 'gping'
cask 'grub-customizer'
cask 'helix'
cask 'hollywood'
cask 'htop'
cask 'inetutils'
cask 'iwd'
cask 'jq'
cask 'kdenlive'
cask 'lazygit'
cask 'librewolf'
cask 'linux-firmware'
cask 'llvm'
cask 'lutris'
cask 'lxappearance'
cask 'ly'
cask 'macchina'
cask 'mediainfo'
cask 'mpv'
cask 'nano'
cask 'ncdu'
cask 'ncmpcpp'
cask 'neofetch'
cask 'net-tools'
cask 'network-manager-applet'
cask 'newsboat'
cask 'nmap'
cask 'nmon'
cask 'obs-linuxbrowser'
cask 'obs'
cask 'obsidian'
cask 'openboard'
cask 'p7zip'
cask 'pandoc'
cask 'paru'
cask 'pcloud'
cask 'pipewire'
cask 'piper'
cask 'pipewire-jack'
cask 'pipewire-pulseaudio'
cask 'podman'
cask 'polkit-gnome'
cask 'prettier'
cask 'protonmail-bridge'
cask 'python-black'
cask 'qt5ct'
cask 'ranger'
cask 'redshift'
cask 'reflector'
cask 'rofi'
cask 'rpi-imager'
cask 'rsync'
cask 'ruby'
cask 'scrcpy'
cask 'screenfetch'
cask 'screenkey'
cask 'signal-beta'
cask 'skippy-xd'
cask 'slock'
cask 'smartmontools'
cask 'snownews'
cask 'spotify'
cask 'steam'
cask 'stow'
cask 'swappy'
cask 'swaybg'
cask 'syncthing'
cask 'telegram-desktop'
cask 'tree'
cask 'ueberzug'
cask 'unzip'
cask 'ventoy'
cask 'vi'
cask 'vim'
cask 'virtualbox'
cask 'vscodium'
cask 'vulkan-sdk'
cask 'waybar'
cask 'wezterm'
cask 'wf-recorder'
cask 'wget'
cask 'wine-stable'
cask 'wireplumber'
cask 'wl-clipboard'
cask 'wlrobs'
cask 'wlroots'
cask 'xbanish'
cask 'xcape'
cask 'xclip'
cask 'xdg-desktop-portal'

# Formulas
brew 'asciinema'
brew 'aura-bin'
brew 'base'
brew 'bat'
brew 'bibata-cursor-theme'
brew 'bluedevil'
brew 'btop'
brew 'buildah'
brew 'calcurse'
brew 'cava'
brew 'chromium'
brew 'cmus'
brew 'colorpicker'
brew 'cowsay'
brew 'cups'
brew 'dialog'
brew 'dmenu'
brew 'efibootmgr'
brew 'exfat-utils'
brew 'fd'
brew 'figlet'
brew 'flake8'
brew 'fuse-overlayfs'
brew 'fzf'
brew 'git'
brew 'google-java-format'
brew 'gotop'
brew 'grim'
brew 'gst-plugin-pipewire'
brew 'hyprpicker'
brew 'joycond'
brew 'kitty'
brew 'kvantum-qt5'
brew 'librewolf-bin'
brew 'libxft-bgra'
brew 'linux'
brew 'lldb'
brew 'ly'
brew 'macchina-bin'
brew 'micro'
brew 'nano'
brew 'ncdu'
brew 'neofetch'
brew 'noto-fonts-cjk'
brew 'noto-fonts-sc'
brew 'npm'
brew 'ntfs-3g'
brew 'nu'
brew 'obs-studio'
brew 'obsidian'
brew 'os-prober'
brew 'pamixer'
brew 'pasystray'
brew 'pcmanfm'
brew 'pipewire'
brew 'pipewire-alsa'
brew 'pipewire-bluez5'
brew 'pipewire-jack'
brew 'pipewire-pulse'
brew 'podman'
brew 'podman-compose'
brew 'polkit-gnome'
brew 'prettier'
brew 'protonmail-bridge'
brew 'python-black'
brew 'python@3.9'
brew 'qt5'
brew 'ranger'
brew 'redshift'
brew 'reflector'
brew 'rofi'
brew 'rpi-imager'
brew 'rsync'
brew 'ruby'
brew 'scrcpy'
brew 'shellcheck'
brew 'shfmt'
brew 'signal-beta'
brew 'slurp'
brew 'smartmontools'
brew 'snownews'
brew 'solidity'
brew 'spotify'
brew 'steam'
brew 'stylua'
brew 'swappy'
brew 'swaybg'
brew 'syncthing'
brew 'telegram-desktop'
brew 'tree'
brew 'ttf-cascadia-code'
brew 'ttf-dejavu'
brew 'ttf-iosevka'
brew 'ttf-joypixels'
brew 'ttf-ms-fonts'
brew 'ttf-ubraille'
brew 'ttf-victor-mono'
brew 'ueberzug'
brew 'unzip'
brew 'ventoy'
brew 'vi'
brew 'vim'
brew 'virtualbox'
brew 'vscodium'
brew 'vulkan-sdk'
brew 'waybar'
brew 'wezterm'
brew 'wf-recorder'
brew 'wget'
brew 'wine'
brew 'wine-mono'
brew 'wireless-tools'
brew 'wireplumber'
brew 'wl-clipboard'
brew 'wlrobs'
brew 'wlroots'
brew 'xbanish'
brew 'xcape'
brew 'xclip'
